---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightDistribution.Clone
source: html/e287ddae-b801-a4af-f23e-827eb9af9393.htm
---
# Autodesk.Revit.DB.Lighting.LightDistribution.Clone Method

Creates a copy of the LightDistribution derived object.

## Syntax (C#)
```csharp
public LightDistribution Clone()
```